<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"cc379cefb8fa9bc1ab3ed91651681277a38eb62fafb4bb031515a1692c4984ca","plan_job_ref":"Job .github/workflows/_test-tf.yaml #61 at https://github.com/DND-IT/github-workflows/actions/runs/15458026716","plan_out_hash":"d7e54eb1e0fa6adf903bad9e7175dd56cf8178386c8ad675bac13e7144f89c32","plan_hash":"173c739d012e937ec80eaa164874beada94b3cef54af8ae17637701db923006b","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #61](https://github.com/DND-IT/github-workflows/actions/runs/15458026716)